[{"name":"Individual Software Development Process","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[{"simultaneous":false,"id":"01219111"}],"description":"Software development process, time management, tracking time, period and production planning, managing personal time, commitments and schedules, project plan, finding defects, code review checklist, projecting defects, economics of defect removal, design defects, product quality, process and personal commitment to quality.","id":"01219245","sections":[{"location":"E 203","id":"450","type":"Lecture","instructors":["Jittat Fakcharoenphol"],"date":"Fri 09.00-12.00","enrolled":36,"accept":999}]},{"name":"Software Patterns and Architecture","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Software architecture process, software quality attributes, software architecture documentation, model-driven architecture, service-oriented architecture, architectural design patterns, concurrent and networked object patterns, enterprise system patterns, internet-based system patterns.","id":"01219449","sections":[{"location":"E 204","id":"450","type":"Lecture","instructors":["Somnuk Keretho"],"date":"Thu 09.00-12.00","enrolled":33,"accept":999},{"location":"E 507","id":"451","type":"Lecture","instructors":["Somnuk Keretho"],"date":"Mon 09.00-12.00","enrolled":28,"accept":999}]},{"name":"Multimedia Data Engineering","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Multimedia systems technology, data formats and standards, compression standards, input/output and storage technologies, user interface, multimedia database, multimedia communications, and distributed multimedia systems.","id":"01219381"},{"name":"Special Problems","credit":{"total":3},"prereq":[],"description":"Study and research in software and knowledge engineering at the bachelor’s degree level and compile into a report.","id":"01219498","sections":[{"location":"E 202","id":"450","type":"Lab","instructors":["Thanawin Rakthanmanon"],"date":"Fri 09.00-12.00","enrolled":23,"accept":999},{"location":"E 505","id":"451","type":"Lab","instructors":["Paruj Ratanaworabhan"],"date":"Sat 13.00-16.00","enrolled":3,"accept":999}]},{"name":"Object-Oriented Programming II","credit":{"self":6,"lab":3,"total":3,"lecture":2},"prereq":[{"simultaneous":true,"id":"01219111"}],"description":"Create and design data types; dynamic method invocation; encapsulation; inheritance; polymorphism; interfaces; exception handling; generics; reflections.","id":"01219113","sections":[{"location":"E 204","id":"450","type":"Lecture","instructors":["Paruj Ratanaworabhan"],"date":"Wed 08.30-10.30","enrolled":35,"accept":999},{"location":"E201","id":"450","type":"Lab","instructors":["Paruj Ratanaworabhan"],"date":"Thu 13.00-16.00","enrolled":35,"accept":999}]},{"name":"Communication Skills for Software and Knowledge Engineers","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Principle concepts of communication; communication within the teams; communication with customers; meeting management and handling for various types of meetings, business meetings, planning meetings, status meetings, and retrospective meetings; practices in various situations related to topics in the course.","id":"01219213"},{"name":"Business Intelligence","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[{"simultaneous":false,"id":"01204351"}],"description":"Management support systems; decision making process; architectures and elements of business intelligence; data warehousing; data warehouse development methodology; application of data warehousing for business intelligence; knowledge discovery; data mining technique; application of data mining for business intelligence.","id":"01219361","sections":[{"location":"E 203","id":"450","type":"Lecture","instructors":["Kitsana Waiyamai"],"date":"Tue 13.00-16.00","enrolled":20,"accept":999}]},{"name":"Innovation Management","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Definition and types of technological innovation, characteristics and innovation management, paradigm shifts in innovation theory and process models, malfunctions in managing an innovation process, strategic and operative conditions facilitating innovation, dynamics of linking innovation strategies to technology cycles and managing innovation streams, implementing innovation strategies through business process redesign, managing knowledge in the organization and motivating human creativity, innovation networks and strategic technology alliances, benchmarking innovation efficiency.","id":"01219373"},{"name":"Abstract Data Types Laboratory","credit":{"self":2,"lab":3,"total":1,"lecture":0},"prereq":[{"simultaneous":true,"id":"01204212"}],"description":"Laboratory for 01204212 Abstract Data Types and Problem Solving.","id":"01219212"},{"name":"Introduction to Data Mining","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Basic concepts of data mining, data mining applications, techniques and models, ethics and privacy issues, data mining software suite, data mining methodologies, decision tables, decision trees, classification rules, clustering, statistical modeling, and linear models.","id":"01219333"},{"name":"Data Warehouse","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Fundamentals of data warehousing, project planning, business requirement definition, dimensional modeling, technical architecture, physical configuration options, project selection, physical database design, data staging process, data staging techniques, target user applications, deployment of data warehouse, system growth management.","id":"01219332"},{"name":"Technical Writing for Software and Knowledge Engineers","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"User documents; design documents; project requirements; project plans; project progress reports; technical reports.","id":"01219412","sections":[{"location":"","id":"95","type":"Lecture","instructors":["Sitichai Srioon","Natnan Tebpech"],"date":"Contact instructor","enrolled":1,"accept":999},{"location":"E 507","id":"450","type":"Lecture","instructors":["Sitichai Srioon","Natnan Tebpech"],"date":"Wed 09.00-12.00","enrolled":32,"accept":999}]},{"name":"Computer System Laboratory","credit":{"self":2,"lab":3,"total":1,"lecture":0},"prereq":[{"simultaneous":true,"id":"01219216"}],"description":"Microprocessor interfacing; low-level C coding; memory systems and cache; binary analysis with debuggers; buffer overflow attacks; coding shell programs.","id":"01219215","sections":[{"location":"E 201","id":"450","type":"Lab","instructors":["Chantana Chantrapornchai"],"date":"Thu 09.00-12.00","enrolled":39,"accept":999}]},{"name":"Software and Knowledge Engineering Individual Project","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Individual project on interesting topic in software and knowledge engineering.","id":"01219495"},{"name":"Hypermedia Presentation","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Hypermedia technology, graphic presentation, animation, video image, audio, perception psychology, multimedia presentation techniques, hypermedia-linked information, presentation design, advertisement, public announcement, hypermedia presentation on the web and Internet.","id":"01219482"},{"name":"Probability and Statistics for Software and Knowledge Engineers","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Probability; conditional probability and independence of events; random variables; distribution and density functions; functions of one random variable; multiple random variables; statistical inference; estimation; hypothesis testing; regression; application to software and knowledge engineering problems.","id":"01219214"},{"name":"Software Entrepreneurship","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Introduction and case studies. Business model development. Strategic planning. Financial resource management. Risk management. Basic accounting. Procedures and laws for establishing a company. Practice with materials in the course.","id":"01219492","sections":[{"location":"","id":"95","type":"Lecture","instructors":["Jittat Fakcharoenphol"],"date":"Contact instructor","enrolled":1,"accept":999},{"location":"E 204","id":"450","type":"Lecture","instructors":["Jittat Fakcharoenphol"],"date":"Tue 16.00-19.00","enrolled":7,"accept":999}]},{"name":"Software Specification and Design Laboratory","credit":{"self":2,"lab":3,"total":1,"lecture":0},"prereq":[{"simultaneous":true,"id":"01219243"}],"description":"Laboratory for 01219243 Software Specification and Design.","id":"01219244","sections":[{"location":"E 507","id":"450","type":"Lab","instructors":["Jittat Fakcharoenphol"],"date":"Fri 13.00-16.00","enrolled":40,"accept":999}]},{"name":"Web Services Technology","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Problems in analyzing and designing web applications from small-scale to large-scale; enterprise applications; applications distributed across corporate intranets, extranets, and internet; web standard protocols and interfaces; web security; web engineering methodology; web architectures and web components; electronic-commerce infrastructures; database and web integration; web services standards and technologies; web-based application development.","id":"01219451"},{"name":"Introduction to Research Methods in Software and Knowledge Engineering","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Research in software and knowledge engineering, characteristics of software and knowledge engineering research, research proposal preparation, data gathering and information retrieval, experiment tools in software and knowledge engineering, data analysis, technical report writing.","id":"01219491"},{"name":"Knowledge Engineering and Knowledge Management","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[{"simultaneous":false,"id":"01204351"}],"description":"Knowledge characteristics, concept, and process of knowledge acquisition, knowledge sources architecture of knowledge-based system, knowledge engineering tools, learning and performance in the knowledge economy, knowledge cycle, varieties of knowledge work, knowledge management opportunities in large enterprise, mechanics of knowledge management, relations between organizational culture and knowledge management.","id":"01219271"},{"name":"Web Application Development","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[{"simultaneous":false,"id":"01219113"}],"description":"Basic concepts of web architecture and the HTTP protocol; architecture of web applications; designing web applications; testing web applications; web application security; scaling web applications; introduction to web services; web application development on cloud technology; practice in developing web application with real target users.","id":"01219351","sections":[{"location":"E 203","id":"450","type":"Lecture","instructors":["Paruj Ratanaworabhan"],"date":"Mon 13.00-16.00","enrolled":31,"accept":999}]},{"name":"Data Communication and Computers Networks Programming","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Data communication network; data transmission; data link controls; local area network and wide area network; communication architecture and protocols; service-oriented programming.","id":"01219321"},{"name":"Group Dynamics and Psychology","credit":{"self":6,"lab":3,"total":3,"lecture":2},"prereq":[],"description":"Individual behavior; individual cognition; cognitive problem complexity; team dynamics; motivation; leadership; conflict management; interacting with stakeholders; uncertainty and ambiguity in software development; dealing with uncertainty and ambiguity; practices in various situations related to topics in the course.","id":"01219391"},{"name":"Workgroup Software Development Process Laboratory","credit":{"self":2,"lab":3,"total":1,"lecture":0},"prereq":[{"simultaneous":true,"id":"01219347"}],"description":"Laboratory for 01219347 Workgroup Software Development Process.","id":"01219348","sections":[{"location":"-","id":"450","type":"Lab","instructors":["Somnuk Keretho"],"date":"Mon 16.00-19.00","enrolled":2,"accept":999}]},{"name":"Electronic Commerce Engineering","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Electronic commerce technology, Electronic commerce system development and implementation, networking technologies and their future directions, database technologies, database-web connectivity, security-related issues, electronic payment systems, business intelligence, trust management, trading agents, privacy, information products and copy protection, digital devide.","id":"01219322"},{"name":"Information Technology for Managing Knowledge","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Traditional information processing systems; the development of information systems; management information systems and information technology for knowledge management; information technology for knowledge development; information technology for knowledge storage; search engines; searching algorithms and methodologies; knowledge representation; artificial intelligence and knowledge management; knowledge management applications.","id":"01219371"},{"name":"Software Testing","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[{"simultaneous":false,"id":"01219243"}],"description":"Basic concepts of software testing. Processes and models of software testing. Component testing, integration testing, system testing, and acceptance testing. Non-functional testing. Review techniques. Static software analysis. Test Planning, estimation, monitoring, and control. Test tools.","id":"01219343","sections":[{"location":"E202","id":"450","type":"Lecture","instructors":["Arnon Rungsawang"],"date":"Fri 13.00-16.00","enrolled":6,"accept":999}]},{"name":"Operating Systems for Software and Knowledge Engineers","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[{"simultaneous":false,"id":"01219111"}],"description":"Basic concepts of interfacing between large-scale software and operating systems, software and hardware interfacing, process management and scheduling, input/output management, memory management, file systems, computer system security.","id":"01219216","sections":[{"location":"E 507","id":"450","type":"Lecture","instructors":["Akrapong Patchararungruang"],"date":"Tue 09.00-12.00","enrolled":53,"accept":999}]},{"name":"Knowledge Representation","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Knowledge representation and its reasoning tasks, basic principles of knowledge representation, advantage and limitations of rule-based systems, frame-based systems and logic-based systems; predicate calculus; semantic networks; ontology of knowledge representation; fuzzy representation.","id":"01219363"},{"name":"Machine Learning","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Techniques and algorithms underlying machine learning, inductive process of decision trees, parametric-based Bayesian learning approach, hidden Markov models, non-parametric methods, discriminant functions, neural networks, stochastic methods, genetic algorithms, unsupervised learning, data clustering.","id":"01219362"},{"name":"Seminar","credit":{"total":1},"prereq":[],"description":"Presentation and discussion on interesting topics in software and knowledge engineering at the bachelor’s degree level.","id":"01219497","sections":[{"location":"E 203","id":"450","type":"Lecture","instructors":["Kitsana Waiyamai"],"date":"Thu 13.00-16.00","enrolled":28,"accept":999}]},{"name":"Computer Organization and Architecture","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Basic computer organization and architecture, registers, arithmetic-logic unit, control unit, machine representation of data and instructions, machine language, assembly language, input/output system, computer evolution, CPU architecture, instruction sets, ALU design, hardwired and micro programmed control, memory hierarchies, virtual memory, cache memory.","id":"01219221"},{"name":"Transaction Processing","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Transactions and their properties, resource managers and transaction managers, transaction processing models, benefits of using transactional versus non-transactional communications, applications that process transactions via the Web, transaction processing monitor, electronic payment transaction, server side applications, transaction services, currently deployed transaction servers.","id":"01219334"},{"name":"Knowledge Discovery","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[{"simultaneous":false,"id":"01219271"}],"description":"Principles of knowledge discovery, automated scientific discovery, inductive reasoning, knowledge discovery processes, knowledge mining algorithms and tools.","id":"01219364"},{"name":"Selected Topics in Software and Knowledge Engineering","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Selected topics in software and knowledge engineering at the bachelor’s degree level, topics are subject to change each semester.","id":"01219496","sections":[{"location":"E 507","id":"450","type":"Lecture","instructors":["Asanee Kawtrakul"],"date":"Fri 09.00-12.00","enrolled":1,"accept":999}]},{"name":"Innovative Software Group Project","credit":{"self":6,"lab":3,"total":3,"lecture":2},"prereq":[{"simultaneous":false,"id":"01219490"}],"description":"Long-term workgroup project on production and development of innovative tools for software and knowledge engineering.","id":"01219499","sections":[{"location":"E 503","id":"450","type":"Lecture","instructors":["Pradondet Nilagupta"],"date":"Thu 09.00-12.00","enrolled":28,"accept":999},{"location":"","id":"450","type":"Lab","instructors":["Pradondet Nilagupta"],"date":"Contact instructor","enrolled":28,"accept":999}]},{"name":"Multimedia Content Analysis","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Fundamental concepts, theories and algorithms for pattern recognition of multimedia data, computer vision, signal processing, speech recognition, multimedia feature extraction, Bayes decision theory, parametric and non-parametric learning, dimension reduction, characteristics of important contents of multimedia data.","id":"01219481"},{"name":"Software Development Training Camp","credit":{"self":2,"lab":3,"total":1,"lecture":0},"prereq":[],"description":"Program development skill enhancement camp, at least 48 person-hours.","id":"01219211"},{"name":"Computer Systems Security","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Computer security, as access control, authentication, authorization, cryptography, system safety, system backup and recovery, security policies.","id":"01219411"},{"name":"Object-Oriented Programming I","credit":{"self":6,"lab":3,"total":3,"lecture":2},"prereq":[],"description":"Program execution on a computer; basic object-oriented language and environments; data types; assignments; conditionals and loops; arrays; input and outputs; functions; comparison of procedural and object-oriented paradigms.","id":"01219111"},{"name":"Software Patterns and Architecture Laboratory","credit":{"self":2,"lab":3,"total":1,"lecture":0},"prereq":[{"simultaneous":true,"id":"01219449"}],"description":"Laboratory for 01219449 Software Patterns and Architecture.","id":"01219448","sections":[{"location":"E 603","id":"450","type":"Lab","instructors":["Somnuk Keretho"],"date":"Thu 13.00-16.00","enrolled":33,"accept":999}]},{"name":"Individual Software Development Process Laboratory","credit":{"self":2,"lab":3,"total":1,"lecture":0},"prereq":[{"simultaneous":true,"id":"01219245"}],"description":"Laboratory for 01219245 Individual Software Development Process.","id":"01219246","sections":[{"location":"E 203","id":"450","type":"Lab","instructors":["Jittat Fakcharoenphol"],"date":"Tue 09.00-12.00","enrolled":36,"accept":999}]},{"name":"Mobile Software Development","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[{"simultaneous":false,"id":"01219113"}],"description":"Mobile software platforms; mobile software development processes; designing mobile user interface; designing and developing mobile software; mobile software distribution channels; practice in developing mobile applications.","id":"01219344","sections":[{"location":"E 204","id":"450","type":"Lecture","instructors":["Jitti Niramitranon"],"date":"Tue 13.00-16.00","enrolled":20,"accept":999}]},{"name":"Introduction to Information Technology","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Computer architecture; data storage in computer system; computer software classification; computer software installation and usage; office software usage; computer network; Internet surfing; information and database management system; basics in computer maintenance; applications of computer in engineering fields.","id":"01219112"},{"name":"Software Specification and Design","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[{"simultaneous":false,"id":"01219111"}],"description":"Development of software specifications; architecture and designing of software analysis; architecture; design patterns; architecture design and detailed design.","id":"01219243","sections":[{"location":"E 507","id":"450","type":"Lecture","instructors":["Jittat Fakcharoenphol"],"date":"Thu 13.00-16.00","enrolled":40,"accept":999}]},{"name":"Cooperative Education","credit":{"total":9},"prereq":[],"description":"On the job training as a temporary according to the assigned project including report and presentation.","id":"01219490"},{"name":"Workgroup Software Development Process","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[{"simultaneous":false,"id":"01219245"},{"simultaneous":true,"id":"01219243"}],"description":"Concept of workgroup, logic of workgroup software process, development strategy, development plan, defining the requirements, role of reader, development manager, design, implementation and system testing by workgroup, Leader role of team development manager role, planning manager role, quality and process manager, and support manager role.","id":"01219347","sections":[{"location":"-","id":"450","type":"Lecture","instructors":["Somnuk Keretho"],"date":"Mon 13.00-16.00","enrolled":2,"accept":999}]},{"name":"Digital Arts","credit":{"self":6,"lab":0,"total":3,"lecture":3},"prereq":[],"description":"Principle of digital arts, Applications in real uses, Creation, storage and presentation of digital art media, Related hardware and software technologies, software engineering in digital arts production, Criticism on digital arts, Case study for drawing, photographing, multimedia presentation, video game and others.","id":"01219483"}]